#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "8294dcda7ecd79fe10cecad0e3031ca3" -> "3843acb051854826c99acef2227334a5"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "6113008ac53d290eea674694329c5199" -> "110b99dd673336ce0441d77d8eb18ed7"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "554c5167dfaa19b2465ef086c0a56385" -> "8b1fe2cddcaa635d3e68de18d8b50cd4"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "1f669f21911d5d32cf194cd9710b580c" -> "44274f2f9d4409feefcb6db49e96880a"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "9edd8d14cf13ed8d63cb9080f3844d17" -> "9851a55f90b6239ac87d47669bdd58d1"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "3051139060eb5187d0ce5cebbd04b5d5" -> "e1e03035d84b81a9440dc1a163eb1c5e"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "2d5cca92cc331abba506bcd753fc8614" -> "b16126a30421b250553969d9c06c0f35"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "df053160a4e243f776e5a5a6105f7ff5" -> "b4e4bcce59726d7550ea5baa73073dfd"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "b1866ad2d9d589c1014096f9f5f15988" -> "da17f781fcd05e84253ab82dbef71f3a"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "8a20be6dd5285dcff8ce362b7b4ae541" -> "b306bdb50b3c643cddf7f9c43f044063"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "7c83e0adc4499c672a596037c8c22ee0" -> "545a60c0ec72a5eb59b94eb9b50e2f7c"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "7df183694d10624eecaecf7d640910f5" -> "87d549ba7d743e7ae254e9edc8fc3fe6"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "ac9a23db5f5163c1a10a662395f80922" -> "a31c97483d625d37664558f0aeb416f9"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "cb7a8639b92d7edd4ad3581f1196a83e" -> "24a17744128d325f61cb71a1db89be73"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "5c680d0f5a99822675932e74cf3a967b" -> "7c4f311abb15e7f9bd1f227da88a280f"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "7b9ad441d613a51a6d10bf0431dfc739" -> "f96261cf52bb2bfa3b863bf817f0fb1b"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "bbd55e41ec8b67f85c18bd559acffe2f" -> "105c5f87543b9a199f162c8f95a112f9"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "aff8128a49fdaac7aa6f06ff9048107a" -> "74afe1ef744512d84ded588f1be68a2d"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "428f3db6fdaae48c33ae44dcb8a6dbf5" -> "ffbb42904fedbb8417cb18c2a8b52a80"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "7958fa90f38ee1db3554cdfdc4b87a2b" -> "c9d94c1fbb1092731baff1ef55d7a007"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "bd393099a3890e9f4cbc0c60169985fd" -> "549d8dedd177ec35b98313cd6dc7ce75"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "490f1076aee6d46e79f68105907fdd71" -> "4b6a36e941fa910e116db2e5510b3bfa"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "2f7d83ab69ba26b12c8c6d703ed6bc23" -> "bf7772a44ae489653aaa606cc9af389c"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "de07d4e4a59aad711dbce499372869cf" -> "971f2398e2e2d761d48c5909ab664b75"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "d7220a913fc4b25b117f5037025c6d01" -> "8a86ce2fad9e924de1f1ddc714fab35c"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "9bf9da40e8b9041bf1ee634b5c7cf30e" -> "29f732f89b2609235d1d5a3d67ffc5c3"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "ce88b1497135ccdf156d3b8870c91e73" -> "614bb724a1839e03bef89a6008d42288"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "da2fc5fd5834fe99f87b9afd7d6542cb" -> "5c2e9a79fd2024f6734e9740af243bdc"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "febf2936f2ee719c05a2d2d7b98c955e" -> "c8e597dbf1d215965decd3808054d702"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "50f7fc23dec08efd544a62e0d314f933" -> "58d782e6cfbb931fd4f0e7c2f963e96d"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "8f99771ea291321c3da4f930e4f77bcc" -> "c56c38ce09176696b9605f873f529888"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "8a5e2cb48e938d7bf6da45dbcb4e8d93" -> "c152ed58105431353b977cefad0792ac"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "ea05e198219b36712b3828e621a6aab2" -> "6fa15c1ebbcec98e82d58683353e0622"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "4dd635146e2036708f442afcabd7ab6d" -> "2a5960de4ecdff5245fea97e5900d08e"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "0a353b9fbc9b3728138af46cc5f5c8fe" -> "9f66d1d7367e0d3d44734f6e8a757da0"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "26138f577106759df222289c309a77a2" -> "996ec1d6fbcee128d9fc8a56b361b0a7"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "3d37aab7b7e8ec8425ca0ddce96b0413" -> "6a8b1efd4bf3326ec26f872fe6ea9d84"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "51b7f76a3bbfb50fb886e1971c399eb8" -> "db724e413c3757339d87d3f8c25a3f48"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "04fcb5ac1b444bb461c227733f1f5679" -> "abf9aef1760542c4f5e08ed6d4cbce7c"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "af71d3525ec8cb370da0177a5c6e1db3" -> "6b2026e8a917f2188b5cf133f66e3753"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "78007dec180bc75d6da164eb459f4efc" -> "b9866e4804c736160c5f6619e71aeab0"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "fe920a13b975d13fe6403cebd8fc549a" -> "be5f775c7ba3ca7e54479afc800f222f"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "77f6a82312c64c40bdc15e130a35c534" -> "e9c5b4fdc44ade73491a0acf7b29a9aa"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "5dcde3bef79c505cee3301ca4a171bb0" -> "129f70f807b02c352946c5699ebeb4fa"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "9dfc25a66ce1901bccbdc4f9c28edbcc" -> "3d6f8308362e20a7ee0576de1b5c20e3"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "fbe8231c2b92b553bb7fa6cdacec3b9b" -> "c0973b947402e2529716ff4d5ce1b017"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "2b660bf12f4ded56243ffa6dd01be76f" -> "2e49b8a2064017c658eadd6f99f272e0"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "aeocWkHcIReJj8UDnvQDE51ailIWPs1ST0HbwuVCiFw=" -> "Cl3jINlbX7eFqZgL4D3870nqoXuUX5OibahiRgWDk54="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "O6Ws/0/F/7Sr5YCr89ynMGvNDVcsdAvKOUG8L0GyKu0=" -> "JQKk67e1OpPA9ICzUUd9ZwwKtSW+pGcewOadZuXyDDU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "WQRlIOQSf8JE0m7Fnd2DKo8aLvn2eLu+3V64jUTEAX0=" -> "kRf2CD8gVrFvLrI2f07N8TKyr1zA4Xs5yAE/yiPK85w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "eaAto1FzHJcqgTZFJQ0fEpYYodc1H/eI3N3YVGAVanw=" -> "DtOoGr2QdqpxBhGGGPOBC5dJcURjrkUx2dybJXQ8YSQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "/FZcHodPdSgtRKvBpnEXE1+AbNGju9ZsbEjnvuqt/Rs=" -> "XfVggxkHYMo0UVv/sW+SNh7XB9RRqxAibbdTyxmWGEQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "3W4iclMyfNoqv8gXh/sVN+qPweRO/UwXg2t8kMvMqKo=" -> "e2HVteW9loM+Tg48zRHxhpV9U9ZINjrwSQCX8QPjsu0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "5SEHq8xQccFWN7cf/Mz37/HfL4jnFWbUfpwAWDC0A1E=" -> "22zPowsgMvVOrnvcWlwjOEKtzr/18dI4cwQ0inaJgvA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "+SuWHXaExhH/ii/m81DQ0N2KuSTFa48VH13N6gBXc60=" -> "z6pkK3aqYII19ZF77rRLx7KBuLKsnQiWCZpPPOBpoLo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "6GtHXJ0GbYpjnK9gyVMXcmLzn6ntbWtlQX7fuKNRxRA=" -> "09eOAPEAfemO4x3yfLogaYFVffk0oK6uiwMA2JvFCG4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "J5uNTJ9sbT8cJ1XlG7U1vW+MClOGwaHn7VZk6tUlJkM=" -> "TwiIm6m1OVMZyvOloPSQIfUhdY70kLyHFi+xgvdBXIE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "HH+XCJpbZDXhr2K08akaE3BYq7YOpOwvW0i1QudZDMY=" -> "laromZfcYlzB6zS7Mls7V/51uIwpzSwvtBGC6+37S74="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "dYz/cbU2jTtf05LeUx6qxsYzYJLTlVJqAEism3hUeJ4=" -> "PhQiAVu+aOuikyKJkkRyWkhAEjkaggLbqBmGu8EPtfY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "YYwxYDuFunNAReCs2vzgA7HKqi81BIDJ+nzvA8ImYN0=" -> "x3anFc0U9BiLq9FRRsNYeIgQF395/kKNtbY/uo19ehM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "/AcXA07nFigCRhIKWlX9DW7gQhHpgDR0kIxPEKvB7T0=" -> "yzASULsP+n1Rj3kQwkR1SIcJSRmyu2CTgefVgGqeqdU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "QS6s5s6TD8il8ZuCGCw1NvzqcI9PRf5U7EGm8pRXcoU=" -> "49cF6gX10RtgmG8orCb3tlRFlHXd9UXKKu5F6nHGpE8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "uQAQ48YV6Ckq/Lg5wOd0xpTkF3nO4cGCO9wDSVpR1eY=" -> "68d+mYQ+MHsnISU60B+WmtCel6B5rIYZfDSZ6Z8Aijc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "CbwIUQB3KWx2uxKGYxnaziFMJyFAeZi7Vu+uDQhzXfQ=" -> "7gpIlH2WUCJbWxPetGeW3U5n+xIdWZ3S5eEy9BKM1oY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BdLefjjTtRUuK3+WIEIS8X1XKzovqjJWpqnRjUiofJc=" -> "8LcgAmY/frZYV4d9M9D+uJvuCJmD2OjDCspzabzy7JA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "W2p1aGQvR0mStvgzdgR/0iCZ8lBUFungWbczHhQ7afc=" -> "0pfZ6LkAtMPPvIJ924Exs4P5R6pwe1eyKDuzfRxPzkI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "BNUvj+wNCNv7/qjEeM0B/tp8Ip3v7CVcs2B3ngdEuBU=" -> "sA3WAlHEtVvVUz4fqYcX1KjGBY/lAvVtC4C48+rBBEc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZlF+Izxx3cnuvjaetk2YPKs6VmbbxL5bVAEcOxUSe4Q=" -> "0LwX+RbVLxmvg1EDyw+Gr0s6TMzvmaQxg1AAs1wChnY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "I9gTVacTakmbrbr/W5/uHQ1ILSGfxu1YNN7G/GP5qYs=" -> "hKMMkRDGkdzJQPO27aMpyzhwt09fII6I53z1dDT/Mvg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "QmF/XPc0nEts+lBc8YulEsUv30CL/TQvomUGCwuXVvY=" -> "/1HOdw9t2GWJnDNOYR8HczEk+/6br2RVdL3I3uEC0pY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "VvX5jl0Sw2PdnUot/rRq3uu3SWct5E8pJl2yaCqBcpg=" -> "8Q/oL14mXFWloX4y/kalNoOZ6WGW7Hnn3JoQY95unw0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "HQDGVQSCy5gj3UMVCyluj84+DAedvUBkvQ06efD1LxE=" -> "AdM6dkZM97N11YUb/UoWh/1TPyE0TRWxeQ4hLui5zYw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "5pGtqRXU5XFf6+evdg7YxOeGlhCb5aa3VCCoidTQH0w=" -> "C4ctngSMJzaE4c4yIQjHlT0/HWNgJNs4cm3FoXoxxdU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "hAG4bOqww4GxGf5WtHGDEV+oLDEgJeO4Our74xsK2vI=" -> "EXM46xNrkIx+QOPhnwDoD62KKq/9ZhV+75ZhQ64YlcY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "bmrpc3AICRPT4zcmkT6Pk/g1g0vAyplOY8iR4g+vS/U=" -> "uJ0jGZGyR4jDqy1syWHXYFy2EzWr6tsymPT3/z8jrMk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "aewkx99UUTlxSlCYzzZd1UZ/lJOcKLaxVa76qWVRJGA=" -> "qcEFhA9zX7dU6PocQu9rSA7qs6G4BFlDiZL8fEGGHB0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "65HtkYQMCbLb87CbwOgP+SyqekuDkjzQYXTCZW0X6io=" -> "mc37f2RRi/l/qfTUbS1FnNqLLOAOUGX9re3DC6Ui//k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-17T03:37:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "TAewythGuG3GtW5oadXErJeXqoFaWl76ffPZWl+Q+tM=" -> "TSsgAWrK8MfPeDfeYyksibnxv/+hJfVvCa+2KgHvTeU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "7sA7OKYpJ0+2YN7yE++KfnFJyBICdKcJ7JkjVT1qwYk=" -> "3ndYDPIFA8RHXjBKhim9iIZ4vsHa6rGvoORoGGnH+GM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "503sWSOagtIRwIdQK7KZ1Pfm1Dh9kFo7mp7XrnEXzOE=" -> "yZt7RlSZsa+v/l/nVebvG+eKTPGJ/Wh8B5JFr8gQUmU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "W2G3yt4lHXIRONk6eyjNuC4FKG/rLBk2FL4QUB1mGys=" -> "5sF4G783kUmY9brWqvGpPx/ES6MDClkykX4K36G/0wI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "omIfBh7mXGtAF6vs3o2dWpyjLnPfCqPbAo0+qFVspUA=" -> "alROHYrJs63ejIqb3IWl0FPNX6uNIiCsZMDW12BF/S0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Vf+l8fS4qnsOXzQu5lUtSp9gQxOAh9DAAhCqiOkTobU=" -> "U4N5jG48cO9sRFcYFMC89lKtjLA6YgCHCIr2+tgnavA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "w2d/Dco1+zRQ/3d82tYvxBuj0uL92cBT/6t3rfAhNRU=" -> "LBx3pV5CK6dnstcQIrzjy7l8v1TjFiSzm7C6ozRgLFU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y4IK+eLkLfo2pkrnK8xbEQq0EehTOhSYYB8tLczJHrs=" -> "m0uu2sbQThyN4PkT4xnQIXJu7/JiHBfvSBJh6RQFruM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "JxPkmKs8wH+inc6CGSzvoOq/8YV6VqFMtynUErEoc98=" -> "8LmDxO1ZU+/EhteLvzr8x8Y92QVRAiFP7+guT8WfZYQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "G2CMktItheKYHrpkCze4xxpt5j8WJZCdyOzJgATQa0s=" -> "jYAdixzXH2svN1GWlS/fd0R+3MqBfPFwLE9nMdshjaU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "GAcV1xsjODZIWLuwqCJ7+U6EMl+pqGqKIhpyjFYzmas=" -> "gJgQ5y1oIpByQLcJ4+T1fJakLSu39MZHE3NOg9RVC3c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "6EaLwgys0nd62SxVh8Pff/yeB/autd+XG0Ju51wWwUU=" -> "o6TITZxU8nxycDfDb2hF3BObo1UiSRbMjKYNZqw6y1o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ix6nNKj8DcY9mcD/YHOwgBWYNITn2UlyaeOy3rS6m3U=" -> "IlZcCrvZlPxT7R9RHz5v2909dVKXnmfRrX+mjHgEEMY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "fOixT9KLZKPS6Dm6i5dif9ml8zELAzQh4D0/N/uI684=" -> "mh01GqJB2ohLOWnV2CVyMcohUAT5hDq7dqKRaS3GJ74="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "QqxOJZNDnfIRoiUxQKlGRiysciOkXvSbmhS66KlOqxE=" -> "EjKBnfcnJxYTPg+YyJmnuvtwL+z5e4oy2tgl7dwi9vc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "8RE3+xt1894hF3iqmeHC1fnPEOeHoNjgh3wh3l/9Mbw=" -> "xWfuysg5db70reRwvQr8tK8HBhm2/GE/G9r5Q/HOCCI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-15T23:08:14Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "vglks1" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-15T23:08:13Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-15T23:08:10Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*